
# %%
''' 创建下面对象：
DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')
'''

# %%
''' 
为DatetimeIndex对象添加UTC时区
DatetimeIndex(['2018-01-01 00:00:00+00:00', '2018-01-01 01:00:00+00:00',
               '2018-01-01 02:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='H')

'''

# %%
'''
将UTC时区对象转化为+8时区
DatetimeIndex(['2017-12-31 16:00:00-08:00', '2017-12-31 17:00:00-08:00',
               '2017-12-31 18:00:00-08:00'],
              dtype='datetime64[ns, US/Pacific]', freq='H')
'''

# %%
''' 创建如下series
In [11]: ts
Out[11]: 
2018-01-01 00:00:00    0
2018-01-01 01:00:00    1
2018-01-01 02:00:00    2
2018-01-01 03:00:00    3
2018-01-01 04:00:00    4
Freq: H, dtype: int64
'''

# %%
'''
计算上题series的2小时内均值 
Out[12]: 
2018-01-01 00:00:00    0.5
2018-01-01 02:00:00    2.5
2018-01-01 04:00:00    4.0
Freq: 2H, dtype: float64
'''

# %%
'''
打印2018-01-05是星期几，英文
'''

# %%
# 输出2018-01-05的下一个周的开始日期


# %%
''' 创建如下series
Out[19]: 
2000-01-01    0
2000-01-02    1
2000-01-03    2
Freq: D, dtype: int64
'''

# %%
''' 创建如下series
Out[20]: 
0   2000-01-01
1   2000-01-02
2   2000-01-03
dtype: datetime64[ns]
'''

# %%
''' 创建如下series
Out[21]: 
0    2011-01
1    2011-02
2    2011-03
dtype: period[M]
'''

# %% 创建如下series
''' 
Out[23]: 
0   2011-01-31
1   2011-02-28
2   2011-03-31
dtype: datetime64[ns]
'''

# %%
''' 使用多种方法创建对象
Out[29]: Timestamp('2012-05-01 00:00:00') 
'''

# %%
''' 
Out[31]: Period('2011-01', 'M')
'''

# %%
# Out[32]: Period('2012-05-01', 'D')

# Out[32]: Period('2012-01-01', 'D')


# %%
'''
Out[44]: DatetimeIndex(['2005-11-23', '2010-12-31'], 
dtype='datetime64[ns]', freq=None)
'''

# %%
'''
from "04-01-2012 10:00" to
Out[45]: DatetimeIndex(['2012-01-04 10:00:00'], dtype='datetime64[ns]', freq=None)

from ["14-01-2012", "01-14-2012"] to
Out[46]: DatetimeIndex(['2012-01-14', '2012-01-14'], dtype='datetime64[ns]', freq=None)

'''

# %%
'''
from ["2018-01-01", "2018-01-03", "2018-01-05"] to
Out[49]: DatetimeIndex(['2018-01-01', '2018-01-03', '2018-01-05'], 
dtype='datetime64[ns]', freq=None)
'''

# %%
'''
from "2010/11/12" to
Out[51]: Timestamp('2010-11-12 00:00:00')
'''

# %%
'''
from 12-11-2010 00:00 to
Out[52]: Timestamp('2010-11-12 00:00:00')
'''


# %% exception
'''
from ["2009/07/31", "asd"]
to Out[57]: DatetimeIndex(['2009-07-31', 'NaT'], 
    dtype='datetime64[ns]', freq=None)
    no raise exception
'''

# %%
'''
from epoch second 1349720105, 1349806505, 1349892905, 1349979305, 1350065705
Out[58]: 
DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05',
               '2012-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)
'''
# %%
'''
from epoch milli seconds [1349720105100, 1349720105200, 1349720105300, 
1349720105400, 1349720105500],
to:
DatetimeIndex(['2012-10-08 18:15:05.100000', '2012-10-08 18:15:05.200000',
               '2012-10-08 18:15:05.300000', '2012-10-08 18:15:05.400000',
               '2012-10-08 18:15:05.500000'],
              dtype='datetime64[ns]', freq=None)
'''
# %%
'''
from
DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05'],
              dtype='datetime64[ns]', freq='D')
to epoch seconds
Int64Index([1349720105, 1349806505, 1349892905, 1349979305], dtype='int64')
'''
# %%
'''
from [1, 2, 3] to
Out[67]: DatetimeIndex(['1960-01-02', '1960-01-03', '1960-01-04'],
     dtype='datetime64[ns]', freq=None)
'''

# %%
'''
from [1, 2, 3] to
Out[68]: DatetimeIndex(['1970-01-02', '1970-01-03', '1970-01-04'], 
    dtype='datetime64[ns]', freq=None)
'''
# %%
'''
from
start = datetime.datetime(2011, 1, 1)
end = datetime.datetime(2012, 1, 1)

to
DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
               ...
               '2011-12-27', '2011-12-28', '2011-12-29', '2011-12-30',
               '2011-12-31', '2012-01-01'],
              dtype='datetime64[ns]', length=366, freq='D')
'''
# %%
'''
from
start = datetime.datetime(2011, 1, 1)
end = datetime.datetime(2012, 1, 1)

to bussiness day range
DatetimeIndex(['2011-01-03', '2011-01-04', '2011-01-05', '2011-01-06',
               '2011-01-13', '2011-01-14',
               ...
               '2011-12-23', '2011-12-26', '2011-12-27', '2011-12-28',
               '2011-12-29', '2011-12-30'],
              dtype='datetime64[ns]', length=260, freq='B')
'''
# %%
'''
'''
# %%
'''
'''
# %%
'''
'''
# %%
'''
'''
# %%
'''
'''
# %%
'''
'''
# %%
'''
'''
# %%
'''
'''

# %%
