#%%

code_map = {
    "codeMap":
    [
        {
            "300054": "国家-中国",
            "300055": "国家-英国",
            "300056": "国家-美国",

            "46000": "网络运营商-中国移动",
            "46001": "网络运营商-中国联通",
            "46002": "网络运营商-中国移动",
            "46003": "网络运营商-中国电信",
            "46005": "网络运营商-中国电信",
            "46006": "网络运营商-中国联通",
            "46007": "网络运营商-中国移动",
            "46011": "网络运营商-中国电信"
        }
    ]
}


policyMap ={
    'en-US':{
                "4007": "设备ROOT",
                "4008": "系统不完整",
                "4009": "硬件合规",
                "4010": "应用不合规",
                "4011": "登录失败",
                "4012": "联通互联网",
                "4013": "终端失联",
                "-4001": "变更SIM卡",
                "-4009": "移除SIM卡",
                "-4002": "更换证书",
                "-4003": "移除证书",
                "-4013": "SIM卡运营商不合规",
            }
}

new_map = {
    "1001":
        {
            "0": "禁止使用",
            "1": "仅扫描",
            "2": "WLAN白名单",
            "3": "不管控",
        },
    "1002":
        {
            "0": "强制开启",
            "1": "禁止使用",
            "2": "不管控",
        },
    "1003":
        {
            "-2": "蓝牙白名单组",
            "0": "禁止使用",
            "1": "蓝牙白名单",
            "2": "不管控",
        },
    "1004":
        {
            "0": "禁止使用",
            "1": "强制开启",
            "2": "不管控",
        },
    "1005":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1006":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1007":
        {
            "0": "禁止使用",
            "1": "强制开启",
            "2": "不管控",
        },
    "1008":
        {
            "0": "仅充电",
            "1": "不管控",
        },
    "1009":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "1010":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1011":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1012":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1013":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1014":
        {
            "0": "禁止使用",
            "1": "不管控",
        },

    "2001":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "2002":
        {
            "0": "禁止使用",
            # "1": "受限使用",
            "2": "不管控",
        },
    "2003":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2004":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "2005":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "2006":
        {
            "0": "禁止使用",
            "3": "基本网络访问规则配置",
            "1": "高级网络访问规则配置",
            "2": "不管控",
        },
    "2007":
        {
            "0": "启用混合密码方式",
            "1": "启用纯数字密码方式",
            "2": "启用生物识别技术",
            "3": "不管控",
        },
    "2008":
        {
            "0": "强制使用网络时间",
            "1": "不管控",
        },
    "2009":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2010":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2011":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2012":
        {
            "0": "禁止使用",
            "1": "授权使用",
            "2": "开放使用",
        },
    "2013":
        {
            "0": "禁止使用",
            "1": "授权使用",
            "2": "开放使用",
        },
    "2014":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "-2002":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "-2003":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "-2004":
        {
            "0": "禁止使用",
            "1": "仅禁止作为数据卡",
            "2": "不管控",
        },
    "-2005":
        {
            "0": "监测并上报",
            "1": "替换并上报",
            "2": "不管控",
        },
    "-2006":
        {
            "0": "监测并上报",
            "1": "替换并上报",
            "2": "拦截并上报",
            "3": "不管控",
        },

    "3001": {"0": "不管控"},
    "3002": {"0": "不管控"},
    "3003": {"0": "不管控"},
    "3004": {"0": "不管控"},
    "3005": {"0": "不管控"},

    "4001": {"0": "不管控"},
    "4002": {"0": "不管控"},
    "4003": {"0": "不管控"},
    "4004": {"0": "不管控"},
    "4006": {"0": "不管控"},
    "-4005": {"0": "不管控"},
    "-4006": {"0": "不管控"},
    "-4007": {"0": "不管控"},
    "-4008": {"0": "不管控"},
    "-4010": {"0": "不管控"},
    "-4011": {"0": "不管控"},
    "-4012": {"0": "不管控"},
    "4007": {"0": "不管控"},
    "4008": {"0": "不管控"},
    "4010": {"0": "不管控"},
    "4011": { "0": "不管控"},
    "4012": {"0": "不管控"},
    "4013": {"0": "不管控"},
    "4014": {"0": "不管控"},
    "-4001": {"0": "不管控"},
    "-4002": {"0": "不管控"},
    "-4003": {"0": "不管控"},
    "-4009": {"0": "不管控"},
    "-4013": {"0": "不管控"},

    "5001":
        {
            "0": "禁止切换容器",
            "1": "不管控",
        },
    "-5001":
        {
            "0": "不启动",
            "1": "启用",
        },
    "-5002":
        {
            "0": "门户模式",
            "1": "桌面模式",
        }
}


import json
import translators as ts
import estrans as estr

es_dict = estr.build_es_dict()

zh_new_map = dict()
for k, v in new_map.items():
    # print(f'key: {k}, value: {v}')
    # print('---------------')
    new_value = dict()
    for k1, v1 in v.items():
        print(f'key: {k1}, value: {v1}')
        if v1:
            _, new_value[k1] = estr.trans_zh_en(v1, es_dict)
        else:
            new_value[k1] = ''
    zh_new_map[k] = new_value
    
print(json.dumps(zh_new_map, indent=4, ensure_ascii=False, default=str))
#%%
zh_map = code_map['codeMap'][0]
# zh_map = code_map['carrierMap'][0]
# zh_map = policyMap['en-US']

en_map = {}
for key in zh_map.keys():
    if zh_map[key]:
        print(zh_map[key])
        _, en_map[key] = estr.trans_zh_en(zh_map[key], es_dict)
    else:
        en_map[key] = ''
    
print(json.dumps(en_map, indent=4, default=str))
    
# print(json.dumps(code_map, indent=2, default=str))

#%% 
import json
new_map = {
    "1001":
        {
            "0": "禁止使用",
            "1": "仅扫描",
            "2": "WLAN白名单",
            "3": "不管控",
        },    

    "3001": {"0": "不管控"},
    
    "-5002":
        {
            "0": "门户模式",
            "1": "桌面模式",
        }
}

zh_new_map = dict()
for k, v in new_map.items():
    # print(f'key: {k}, value: {v}')
    # print('---------------')
    new_value = dict()
    for k1, v1 in v.items():
        # print(f'key: {k1}, value: {v1}')
        new_value[k1] = v1 # todo: translate
    zh_new_map[k] = new_value
    
print(json.dumps(zh_new_map, indent=2, ensure_ascii=False, default=str))
