#%%

code_map = {
    "codeMap":
    [
        {
            "9991": "页面未找到",
            "9992": "推荐",
            "9993": "强制",
            "9994": "用户模板格式错误",
            "9995": "没数据",
            "9996": "请求的参数传递有误",
            "9997": "请登录",
            "9998": "注销成功",
            "9999": "未知错误",

            "820000":"用户警钟-协辅警", 
            "820001":"用户警钟-民警", 
            "820002":"用户警钟-科员", 
            "820003":"用户警钟-副科级", 
            "820004":"用户警钟-正科级", 
            "820005":"用户警钟-副处级", 
            "820006":"用户警钟-正处级", 
            "820007":"用户警钟-副厅级", 
            "820008":"用户警钟-正厅级", 
            "820009":"用户警钟-副部级", 
            "820010":"用户警钟-正部级", 

            "cate-1":"应用分类-I类",
            "cate-2":"应用分类-II类",
            "cate-3":"应用分类-III类",

            "area-1":"访问区域-I类区域",
            "area-2":"访问区域-II类区域",
            "area-3":"访问区域-III类区域",

            "class-001":"应用类型-推荐",
            "class-002":"应用类型-专业",
            "class-003":"应用类型-综合",
            "class-004":"应用类型-基础",
            "class-005":"应用类型-管理",

            "51000": "用户状态-全部状态",
            "51001": "用户状态-正常",
            "51002": "用户状态-停用",
            "51003": "用户状态-已过期",
            "51004": "用户状态-已停用",
            "51005": "用户状态-已锁定",
            "51006": "用户状态-待注册",
            "51007": "用户状态-已删除",
            "51008": "用户状态-密码冻结",
            "51009": "用户状态-禁止授权",
            "51030": "用户授权状态-正常",
            "51031": "用户授权状态-禁止授权",
            "51032": "用户状态-已离职",


            "51310": "用户性别-男",
            "51311": "用户性别-女",

            "52201": "文档已安装",
            "52202": "文档未安装",

            "53100": "策略类型",
            "53101": "设置类型",
            "53102": "文档类型",

            "54101": "表格排序-升序",
            "54102": "表格排序-降序",

            "57101": "子树",
            "57102": "一级",
            "57103": "对象",

            "57201": "命令对象-用户",
            "57202": "命令对象-静态组",
            "57206": "命令对象-应用",
            "57215": "命令对象-机构",
            "57216": "机构用户过滤-直属用户",
            "57217": "机构用户过滤-下属用户",

            "57235": "命令对象-动态组",
            "57236": "命令对象-用户身份",
            "57237": "命令对象-警种",
            "57238": "命令对象-职级",
            "57239": "命令对象-行政地区",
            "57240": "命令对象-用户标签",
            "57213": "命令对象-LDAP设置",
            "57212": "命令对象-数据字典",
            "57221": "命令对象-系统设置",
            "57214": "命令对象-用户组",



            "61910": "应用类型-移动应用",
            "61911": "应用类型-web应用",

            "63100": "授权",
            "63101": "取消授权",

            "android":"安卓应用",
            "ios":"苹果应用",
            "web app":"轻应用",
            "web":"web应用"
        }
    ]
}


policyMap ={
    'en-US':{
                "4007": "设备ROOT",
                "4008": "系统不完整",
                "4009": "硬件合规",
                "4010": "应用不合规",
                "4011": "登录失败",
                "4012": "联通互联网",
                "4013": "终端失联",
                "-4001": "变更SIM卡",
                "-4009": "移除SIM卡",
                "-4002": "更换证书",
                "-4003": "移除证书",
                "-4013": "SIM卡运营商不合规",
            }
}

new_map = {
    "1001":
        {
            "0": "禁止使用",
            "1": "仅扫描",
            "2": "WLAN白名单",
            "3": "不管控",
        },
    "1002":
        {
            "0": "强制开启",
            "1": "禁止使用",
            "2": "不管控",
        },
    "1003":
        {
            "-2": "蓝牙白名单组",
            "0": "禁止使用",
            "1": "蓝牙白名单",
            "2": "不管控",
        },
    "1004":
        {
            "0": "禁止使用",
            "1": "强制开启",
            "2": "不管控",
        },
    "1005":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1006":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1007":
        {
            "0": "禁止使用",
            "1": "强制开启",
            "2": "不管控",
        },
    "1008":
        {
            "0": "仅充电",
            "1": "不管控",
        },
    "1009":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "1010":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1011":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1012":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1013":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "1014":
        {
            "0": "禁止使用",
            "1": "不管控",
        },

    "2001":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "2002":
        {
            "0": "禁止使用",
            # "1": "受限使用",
            "2": "不管控",
        },
    "2003":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2004":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "2005":
        {
            "0": "禁止使用",
            "1": "受限使用",
            "2": "不管控",
        },
    "2006":
        {
            "0": "禁止使用",
            "3": "基本网络访问规则配置",
            "1": "高级网络访问规则配置",
            "2": "不管控",
        },
    "2007":
        {
            "0": "启用混合密码方式",
            "1": "启用纯数字密码方式",
            "2": "启用生物识别技术",
            "3": "不管控",
        },
    "2008":
        {
            "0": "强制使用网络时间",
            "1": "不管控",
        },
    "2009":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2010":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2011":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "2012":
        {
            "0": "禁止使用",
            "1": "授权使用",
            "2": "开放使用",
        },
    "2013":
        {
            "0": "禁止使用",
            "1": "授权使用",
            "2": "开放使用",
        },
    "2014":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "-2002":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "-2003":
        {
            "0": "禁止使用",
            "1": "不管控",
        },
    "-2004":
        {
            "0": "禁止使用",
            "1": "仅禁止作为数据卡",
            "2": "不管控",
        },
    "-2005":
        {
            "0": "监测并上报",
            "1": "替换并上报",
            "2": "不管控",
        },
    "-2006":
        {
            "0": "监测并上报",
            "1": "替换并上报",
            "2": "拦截并上报",
            "3": "不管控",
        },

    "3001": {"0": "不管控"},
    "3002": {"0": "不管控"},
    "3003": {"0": "不管控"},
    "3004": {"0": "不管控"},
    "3005": {"0": "不管控"},

    "4001": {"0": "不管控"},
    "4002": {"0": "不管控"},
    "4003": {"0": "不管控"},
    "4004": {"0": "不管控"},
    "4006": {"0": "不管控"},
    "-4005": {"0": "不管控"},
    "-4006": {"0": "不管控"},
    "-4007": {"0": "不管控"},
    "-4008": {"0": "不管控"},
    "-4010": {"0": "不管控"},
    "-4011": {"0": "不管控"},
    "-4012": {"0": "不管控"},
    "4007": {"0": "不管控"},
    "4008": {"0": "不管控"},
    "4010": {"0": "不管控"},
    "4011": { "0": "不管控"},
    "4012": {"0": "不管控"},
    "4013": {"0": "不管控"},
    "4014": {"0": "不管控"},
    "-4001": {"0": "不管控"},
    "-4002": {"0": "不管控"},
    "-4003": {"0": "不管控"},
    "-4009": {"0": "不管控"},
    "-4013": {"0": "不管控"},

    "5001":
        {
            "0": "禁止切换容器",
            "1": "不管控",
        },
    "-5001":
        {
            "0": "不启动",
            "1": "启用",
        },
    "-5002":
        {
            "0": "门户模式",
            "1": "桌面模式",
        }
}


import json
import translators as ts
import estrans as estr

es_dict = estr.build_es_dict()

zh_new_map = dict()
for k, v in new_map.items():
    # print(f'key: {k}, value: {v}')
    # print('---------------')
    new_value = dict()
    for k1, v1 in v.items():
        print(f'key: {k1}, value: {v1}')
        if v1:
            _, new_value[k1] = estr.trans_zh_en(v1, es_dict)
        else:
            new_value[k1] = ''
    zh_new_map[k] = new_value
    
print(json.dumps(zh_new_map, indent=4, ensure_ascii=False, default=str))
#%%
# zh_map = code_map['codeMap'][0]
# zh_map = code_map['carrierMap'][0]
zh_map = policyMap['en-US']

en_map = {}
for key in zh_map.keys():
    if zh_map[key]:
        print(zh_map[key])
        _, en_map[key] = estr.trans_zh_en(zh_map[key], es_dict)
    else:
        en_map[key] = ''
    
print(json.dumps(en_map, indent=4, default=str))
    
# print(json.dumps(code_map, indent=2, default=str))

#%% 
import json
new_map = {
    "1001":
        {
            "0": "禁止使用",
            "1": "仅扫描",
            "2": "WLAN白名单",
            "3": "不管控",
        },    

    "3001": {"0": "不管控"},
    
    "-5002":
        {
            "0": "门户模式",
            "1": "桌面模式",
        }
}

zh_new_map = dict()
for k, v in new_map.items():
    # print(f'key: {k}, value: {v}')
    # print('---------------')
    new_value = dict()
    for k1, v1 in v.items():
        # print(f'key: {k1}, value: {v1}')
        new_value[k1] = v1 # todo: translate
    zh_new_map[k] = new_value
    
print(json.dumps(zh_new_map, indent=2, ensure_ascii=False, default=str))