#%%

code_map = {
    "codeMap":
    [
        {
            "9991": "页面未找到",
            "9992": "推荐",
            "9993": "强制",
            "9994": "用户模板格式错误",
            "9995": "没数据",
            "9996": "请求的参数传递有误",
            "9997": "请登录",
            "9998": "注销成功",
            "9999": "未知错误",

            "820000":"用户警钟-协辅警", 
            "820001":"用户警钟-民警", 
            "820002":"用户警钟-科员", 
            "820003":"用户警钟-副科级", 
            "820004":"用户警钟-正科级", 
            "820005":"用户警钟-副处级", 
            "820006":"用户警钟-正处级", 
            "820007":"用户警钟-副厅级", 
            "820008":"用户警钟-正厅级", 
            "820009":"用户警钟-副部级", 
            "820010":"用户警钟-正部级", 

            "cate-1":"应用分类-I类",
            "cate-2":"应用分类-II类",
            "cate-3":"应用分类-III类",

            "area-1":"访问区域-I类区域",
            "area-2":"访问区域-II类区域",
            "area-3":"访问区域-III类区域",

            "class-001":"应用类型-推荐",
            "class-002":"应用类型-专业",
            "class-003":"应用类型-综合",
            "class-004":"应用类型-基础",
            "class-005":"应用类型-管理",

            "51000": "用户状态-全部状态",
            "51001": "用户状态-正常",
            "51002": "用户状态-停用",
            "51003": "用户状态-已过期",
            "51004": "用户状态-已停用",
            "51005": "用户状态-已锁定",
            "51006": "用户状态-待注册",
            "51007": "用户状态-已删除",
            "51008": "用户状态-密码冻结",
            "51009": "用户状态-禁止授权",
            "51030": "用户授权状态-正常",
            "51031": "用户授权状态-禁止授权",
            "51032": "用户状态-已离职",


            "51310": "用户性别-男",
            "51311": "用户性别-女",

            "52201": "文档已安装",
            "52202": "文档未安装",

            "53100": "策略类型",
            "53101": "设置类型",
            "53102": "文档类型",

            "54101": "表格排序-升序",
            "54102": "表格排序-降序",

            "57101": "子树",
            "57102": "一级",
            "57103": "对象",

            "57201": "命令对象-用户",
            "57202": "命令对象-静态组",
            "57206": "命令对象-应用",
            "57215": "命令对象-机构",
            "57216": "机构用户过滤-直属用户",
            "57217": "机构用户过滤-下属用户",

            "57235": "命令对象-动态组",
            "57236": "命令对象-用户身份",
            "57237": "命令对象-警种",
            "57238": "命令对象-职级",
            "57239": "命令对象-行政地区",
            "57240": "命令对象-用户标签",
            "57213": "命令对象-LDAP设置",
            "57212": "命令对象-数据字典",
            "57221": "命令对象-系统设置",
            "57214": "命令对象-用户组",



            "61910": "应用类型-移动应用",
            "61911": "应用类型-web应用",

            "63100": "授权",
            "63101": "取消授权",

            "android":"安卓应用",
            "ios":"苹果应用",
            "web app":"轻应用",
            "web":"web应用"
        }
    ]
}


import json
import translators as ts
import estrans as estr

es_dict = estr.build_es_dict()

zh_map = code_map['codeMap'][0]
# zh_map = code_map['carrierMap'][0]

en_map = {}
for key in zh_map.keys():
    if zh_map[key]:
        print(zh_map[key])
        _, en_map[key] = estr.trans_zh_en(zh_map[key], es_dict)
    else:
        en_map[key] = ''
    
print(json.dumps(en_map, indent=2, default=str))
    
# print(json.dumps(code_map, indent=2, default=str))

#%% 
import json
import translators as ts
print(ts.google('再见，世界！', 'zh', 'en'))

#%%
import estrans as estr

es_dict = estr.build_es_dict()
_, en = estr.trans_zh_en('再见，世界！哈哈!', es_dict)
print(en)
